#include "Leetcode.h"
//1. 两数之和
//给定一个整数数组 nums 和一个目标值 target，请你在该数组中找出和为目标值的那 两个 整数，并返回他们的数组下标。
//你可以假设每种输入只会对应一个答案。但是，你不能重复利用这个数组中同样的元素。
//
//示例:
//给定 nums = [2, 7, 11, 15], target = 9
//因为 nums[0] + nums[1] = 2 + 7 = 9
//所以返回 [0, 1]

//执行用时 :148 ms, 在所有 cpp 提交中击败了50.71% 的用户
//内存消耗 :9.3 MB, 在所有 cpp 提交中击败了78.39%的用户
vector<int> Solution::twoSum(vector<int>& nums, int target){
    int size=nums.size();
    for(int i=0;i<size-1;i++){
        int nums1=target-nums[i];
        for(int j=i+1;j<size;j++){
            if(nums1==nums[j])
                return {i,j};
        }
    }
    return {};
}
//2. 两数相加
//给出两个 非空 的链表用来表示两个非负的整数。其中，它们各自的位数是按照 逆序 的方式存储的，并且它们的每个节点只能存储 一位 数字。
//如果，我们将这两个数相加起来，则会返回一个新的链表来表示它们的和。
//您可以假设除了数字 0 之外，这两个数都不会以 0 开头。
//
//示例：
//输入：(2 -> 4 -> 3) + (5 -> 6 -> 4)
//输出：7 -> 0 -> 8
//原因：342 + 465 = 807


ListNode *Solution::addTwoNumbers(ListNode *l1, ListNode *l2) {


    return nullptr;
}



//7. 整数反转
//给出一个 32 位的有符号整数，你需要将这个整数中每位上的数字进行反转。
//
//示例 1:
//输入: 123
//输出: 321
//
//示例 2:
//输入: -123
//输出: -321
//
//示例 3:
//输入: 120
//输出: 21
//
//注意:
//假设我们的环境只能存储得下 32 位的有符号整数，则其数值范围为 [−231,  231 − 1]。请根据这个假设，如果反转后整数溢出那么就返回 0。

//执行用时 :0 ms, 在所有 cpp 提交中击败了100.00% 的用户
//内存消耗 :8 MB, 在所有 cpp 提交中击败了97.19%的用户

const long MAX = (1<<31)-1, MIN = (-1<<31); //最大最小值
int Solution::reverse(int x) {
    if (x / 10 == 0) return x; //绝对值小于10，直接返回
    long y = 0;
    while (x) {
        y *= 10;
        if (y > MAX || y < MIN)
            return 0;
        y += x % 10; //取出x的个位
        x /= 10;     //去掉x的个位
    }
    return y;
}