
#include "TreeNode.h"
/*
 * 用c/c++实现平衡二叉树，创建查找插入删除，导出排序数值。
 */


/*------------------------删除-----------------------------*/



/*---------------------------------------------------------*/

/*------------------------插入-----------------------------*/

/*
前序遍历：[5,3,2,1,4,7,6,9,8]
中序遍历：[1,2,3,4,5,6,7,8,9]
后序遍历：[1,2,4,3,6,8,9,7,5]
 */
/*---------------------------------------------------------*/

int main() {
    printf("----------------新建-----------------\n");
    vector<int> x={10,20,30,40,50,60,70,80};
    TreeNode *t=build(x);
    outPut_DLR(t);
    outPut_LDR(t);
    outPut_LRD(t);
    printf("----------------查找-----------------\n");
    outPut_Find(t,10);
    outPut_Find(t,11);
    printf("----------------添加-----------------\n");
    insert(t,90);
    outPut_DLR(t);
    insert(t,90);
    outPut_DLR(t);
    insert(t,75);
    outPut_DLR(t);
    printf("----------------删除-----------------\n");
    deleteVal(t,81);
    outPut_DLR(t);
    deleteVal(t,80);
    outPut_DLR(t);
    deleteVal(t,75);
    outPut_DLR(t);
    deleteVal(t,70);
    outPut_DLR(t);
    deleteVal(t,70);
    outPut_DLR(t);
    printf("----------------end-----------------\n");
    return 0;
}